/* Доп:
Игра «Жизнь» была придумана английским математиком Джоном Конвейем в 1970 году.
Впервые описание этой игры опубликовано в октябрьском выпуске (1970) журнала Scientic American,
в рубрике «Математические игры» Мартина Гарднера.

Место действия этой игры – «вселенная» – это размеченная на клетки поверхность.
Каждая клетка на этой поверхности может находиться в двух состояниях: быть живой или быть мертвой.
Клетка имеет восемь соседей. Распределение живых клеток в начале игры называется первым поколением.
Каждое следующее поколение рассчитывается на основе предыдущего по таким правилам:

1)пустая(мертвая) клетка с ровно тремя живыми клетками-соседями оживает;
2)если у живой клетки есть две или три живые соседки, то эта клетка продолжает жить;
в противном случае (если соседок меньше двух или больше трех)
клетка умирает(от «одиночества» или от «перенаселенности»).
В этой задаче рассматривается игра «Жизнь» на торе.
Представим себе прямоугольник размером n строк на m столбцов.
Для того, чтобы превратить его в тор мысленно «склеим» его верхнюю сторону с нижней, а левую с правой.

Таким образом, у каждой клетки, даже если она раньше находилась на границе прямоугольника,
теперь есть ровно восемь соседей.

Ваша задача состоит в том, чтобы найти конфигурацию клеток, которая будет через k поколений от заданного.

n m k(4 ≤ n, m ≤ 100; 0 ≤ k ≤ 100).

5 5 1          5 5 5           4 7 5
++...  .+.++   ++...   .+++.   .+.+.+.   .......
..++.  +.+..   ..++.   .+...   +.+.+.+   .......
.+...  .+.+.   .+...   .+...   .+.+.+.   .......
..+..  ..+..   ..+..   ..++.   +.+.+.+   .......
...+.  .++..   ...+.   ..... */

using System;
using static System.Console;

// Основное действие
Clear();
string[,] planet = LiveDeathPlanet("Введите размеры планеты (высота, ширина) через пробел и нажмите Enter: ");
PopulatePlanet(planet);
SeePlanet(planet);
WriteLine();
Write("Введите количество поколений, нажмите Enter и наблюдаем симуляцию: ");
int countGenerations = int.Parse(ReadLine());
int generation = 0;
while(generation <= countGenerations){
    
}

string[,] LiveDeathPlanet(string text) // Задаем размеры планеты
{
    Write(text);
    int[] sizePlanet = ReadLine().Split(" ").Select(int.Parse).ToArray();
    string[,] planet = new string[sizePlanet[0] ,sizePlanet[1]];
    return planet;
}

void PopulatePlanet(string[,] array) // Задаем жизнь на планете
{
    string[] chars = {"#", "-"};
    for (int i = 0; i < array.GetLength(0); i++){
        for (int j = 0; j < array.GetLength(1); j++){
            array[i,j] = chars[new Random().Next(0, 2)];
        }        
    }
}

void SeePlanet(string[,] array) // Увидеть планету
{
    for (int i = 0; i < array.GetLength(0); i++){
        for (int j = 0; j < array.GetLength(1); j++){
            Write($"{array[i,j]} ");
        }
        WriteLine();
    }
}